#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_role_assignment.devs_group_rg_es will be created
  + resource "azurerm_role_assignment" "devs_group_rg_es" {
      + description                      = "Allow ES Dev group to manage resource group"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e26fbb5f-cac3-481b-a5d7-7671e86b0892"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-selfcare-importadesioni-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.devs_group_rg_es_itn will be created
  + resource "azurerm_role_assignment" "devs_group_rg_es_itn" {
      + description                      = "Allow ES Dev group to manage resource group"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e26fbb5f-cac3-481b-a5d7-7671e86b0892"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-importadesioni-rg-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.functions_app.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_NODE_DEFAULT_VERSION"                    = "16.9.1"
          + "WEBSITE_VNET_ROUTE_ALL"                          = "1"
            # (26 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-selfcare-importadesioni-rg/providers/Microsoft.Web/sites/io-p-importadesioni-fn"
        name                                           = "io-p-importadesioni-fn"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-selfcare-importadesioni"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with azurerm_cosmosdb_sql_container.db_importadesioni_containers["pecEmail"],
  on database.tf line 81, in resource "azurerm_cosmosdb_sql_container" "db_importadesioni_containers":
  81:   partition_key_path    = each.value.partition_key_path

`partition_key_path` will be removed in favour of the property
`partition_key_paths` in version 4.0 of the AzureRM Provider.

(and 9 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
